// Задание Принимает на вход три числа и выдаёт максимальное из этих чисел
 Console.WriteLine("Введите число:");
 a = Convert.ToInt32(Console.ReadLine());

if (a % 2 == 1)
{
 Console.WriteLine("Число " + a + " Нечётное");
}
else
{
Console.WriteLine("Число " + a + " Чётное");
}